Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
"scripts/aws_regions" < regiondb.json > "aws_regions.tf.json.tmp"
mv -f -- "aws_regions.tf.json.tmp" "aws_regions.tf.json"
"scripts/providers" < regiondb.json > "providers.tf.json.tmp"
mv -f -- "providers.tf.json.tmp" "providers.tf.json"
"scripts/peering" < regiondb.json > "peering.tf.json.tmp"
mv -f -- "peering.tf.json.tmp" "peering.tf.json"
mkdir -p distfiles 
curl -o "distfiles/terraform_0.12.24_SHA256SUMS.sig.tmp" "https://releases.hashicorp.com/terraform/0.12.24/terraform_0.12.24_SHA256SUMS.sig"
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   287  100   287    0     0   1161      0 --:--:-- --:--:-- --:--:--  1161
mv -f -- "distfiles/terraform_0.12.24_SHA256SUMS.sig.tmp" "distfiles/terraform_0.12.24_SHA256SUMS.sig"
curl -o "distfiles/terraform_0.12.24_SHA256SUMS.tmp" "https://releases.hashicorp.com/terraform/0.12.24/terraform_0.12.24_SHA256SUMS"
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100  1205  100  1205    0     0  16736      0 --:--:-- --:--:-- --:--:-- 16736
set -eux \
	  && tmp="$(mktemp -d)" \
	  && trap 'rm -rf -- "$tmp"' EXIT \
	  && gpg --homedir "$tmp" --import hashicorp.asc \
	  && gpg --homedir "$tmp" --trust-model always --verify "distfiles/terraform_0.12.24_SHA256SUMS.sig" "distfiles/terraform_0.12.24_SHA256SUMS.tmp" \
	  && exec rm -rf -- "$tmp"
++ mktemp -d
+ tmp=/var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm
+ trap 'rm -rf -- "$tmp"' EXIT
+ gpg --homedir /var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm --import hashicorp.asc
gpg: keybox '/var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm/pubring.kbx' created
gpg: /var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm/trustdb.gpg: trustdb created
gpg: key 51852D87348FFC4C: public key "HashiCorp Security <security@hashicorp.com>" imported
gpg: Total number processed: 1
gpg:               imported: 1
+ gpg --homedir /var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm --trust-model always --verify distfiles/terraform_0.12.24_SHA256SUMS.sig distfiles/terraform_0.12.24_SHA256SUMS.tmp
gpg: Signature made Thu Mar 19 10:19:12 2020 CDT
gpg:                using RSA key 51852D87348FFC4C
gpg: Good signature from "HashiCorp Security <security@hashicorp.com>" [unknown]
gpg: WARNING: Using untrusted key!
+ exec rm -rf -- /var/folders/n9/nlyh791x2t73mmzl7l6l_fs00000gp/T/tmp.L9uHPeCm
mv -f -- "distfiles/terraform_0.12.24_SHA256SUMS.tmp" "distfiles/terraform_0.12.24_SHA256SUMS"
awk '$2 == "terraform_0.12.24_darwin_amd64.zip" { print $1 "\tdistfiles/" $2 ".tmp" }' < "distfiles/terraform_0.12.24_SHA256SUMS" > "distfiles/terraform_0.12.24_SHA256SUMS_darwin_amd64.tmp"
mv -f -- "distfiles/terraform_0.12.24_SHA256SUMS_darwin_amd64.tmp" "distfiles/terraform_0.12.24_SHA256SUMS_darwin_amd64"
curl -o "distfiles/terraform_0.12.24_darwin_amd64.zip.tmp" "https://releases.hashicorp.com/terraform/0.12.24/terraform_0.12.24_darwin_amd64.zip"
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0  0 17.1M    0 79473    0     0   768k      0  0:00:22 --:--:--  0:00:22  760k 15 17.1M   15 2767k    0     0  2511k      0  0:00:06  0:00:01  0:00:05 2509k 32 17.1M   32 5663k    0     0  2695k      0  0:00:06  0:00:02  0:00:04 2694k 48 17.1M   48 8559k    0     0  2760k      0  0:00:06  0:00:03  0:00:03 2759k 65 17.1M   65 11.1M    0     0  2781k      0  0:00:06  0:00:04  0:00:02 2780k 80 17.1M   80 13.8M    0     0  2785k      0  0:00:06  0:00:05  0:00:01 2826k 97 17.1M   97 16.6M    0     0  2792k      0  0:00:06  0:00:06 --:--:-- 2854k100 17.1M  100 17.1M    0     0  2800k      0  0:00:06  0:00:06 --:--:-- 2853k
sha256sum -c < "distfiles/terraform_0.12.24_SHA256SUMS_darwin_amd64"
distfiles/terraform_0.12.24_darwin_amd64.zip.tmp: OK
mv -f -- "distfiles/terraform_0.12.24_darwin_amd64.zip.tmp" "distfiles/terraform_0.12.24_darwin_amd64.zip"
cd distfiles && unzip "terraform_0.12.24_darwin_amd64.zip"
Archive:  terraform_0.12.24_darwin_amd64.zip
  inflating: terraform               
touch distfiles/terraform
mv -f distfiles/terraform "distfiles/terraform-0.12.24"
./scripts/softlimit distfiles/terraform-0.12.24 init -no-color
Initializing modules...
- aws_region_ap-northeast-1 in modules/aws_region
- aws_region_ap-northeast-2 in modules/aws_region
- aws_region_ap-south-1 in modules/aws_region
- aws_region_ap-southeast-1 in modules/aws_region
- aws_region_ap-southeast-2 in modules/aws_region
- aws_region_eu-central-1 in modules/aws_region
- aws_region_eu-north-1 in modules/aws_region
- aws_region_eu-west-1 in modules/aws_region
- aws_region_eu-west-2 in modules/aws_region
- aws_region_eu-west-3 in modules/aws_region
- aws_region_sa-east-1 in modules/aws_region
- aws_region_us-east-1 in modules/aws_region
- aws_region_us-east-2 in modules/aws_region
- aws_region_us-west-1 in modules/aws_region
- aws_region_us-west-2 in modules/aws_region
- peering-accepter_ap-northeast-1_ap-northeast-2 in modules/peering-accepter
- peering-accepter_ap-northeast-1_ap-south-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_ap-southeast-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_ap-southeast-2 in modules/peering-accepter
- peering-accepter_ap-northeast-1_eu-central-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_eu-north-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_eu-west-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_eu-west-2 in modules/peering-accepter
- peering-accepter_ap-northeast-1_eu-west-3 in modules/peering-accepter
- peering-accepter_ap-northeast-1_sa-east-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_us-east-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_us-east-2 in modules/peering-accepter
- peering-accepter_ap-northeast-1_us-west-1 in modules/peering-accepter
- peering-accepter_ap-northeast-1_us-west-2 in modules/peering-accepter
- peering-accepter_ap-northeast-2_ap-south-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_ap-southeast-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_ap-southeast-2 in modules/peering-accepter
- peering-accepter_ap-northeast-2_eu-central-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_eu-north-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_eu-west-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_eu-west-2 in modules/peering-accepter
- peering-accepter_ap-northeast-2_eu-west-3 in modules/peering-accepter
- peering-accepter_ap-northeast-2_sa-east-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_us-east-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_us-east-2 in modules/peering-accepter
- peering-accepter_ap-northeast-2_us-west-1 in modules/peering-accepter
- peering-accepter_ap-northeast-2_us-west-2 in modules/peering-accepter
- peering-accepter_ap-south-1_ap-southeast-1 in modules/peering-accepter
- peering-accepter_ap-south-1_ap-southeast-2 in modules/peering-accepter
- peering-accepter_ap-south-1_eu-central-1 in modules/peering-accepter
- peering-accepter_ap-south-1_eu-north-1 in modules/peering-accepter
- peering-accepter_ap-south-1_eu-west-1 in modules/peering-accepter
- peering-accepter_ap-south-1_eu-west-2 in modules/peering-accepter
- peering-accepter_ap-south-1_eu-west-3 in modules/peering-accepter
- peering-accepter_ap-south-1_sa-east-1 in modules/peering-accepter
- peering-accepter_ap-south-1_us-east-1 in modules/peering-accepter
- peering-accepter_ap-south-1_us-east-2 in modules/peering-accepter
- peering-accepter_ap-south-1_us-west-1 in modules/peering-accepter
- peering-accepter_ap-south-1_us-west-2 in modules/peering-accepter
- peering-accepter_ap-southeast-1_ap-southeast-2 in modules/peering-accepter
- peering-accepter_ap-southeast-1_eu-central-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_eu-north-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_eu-west-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_eu-west-2 in modules/peering-accepter
- peering-accepter_ap-southeast-1_eu-west-3 in modules/peering-accepter
- peering-accepter_ap-southeast-1_sa-east-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_us-east-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_us-east-2 in modules/peering-accepter
- peering-accepter_ap-southeast-1_us-west-1 in modules/peering-accepter
- peering-accepter_ap-southeast-1_us-west-2 in modules/peering-accepter
- peering-accepter_ap-southeast-2_eu-central-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_eu-north-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_eu-west-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_eu-west-2 in modules/peering-accepter
- peering-accepter_ap-southeast-2_eu-west-3 in modules/peering-accepter
- peering-accepter_ap-southeast-2_sa-east-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_us-east-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_us-east-2 in modules/peering-accepter
- peering-accepter_ap-southeast-2_us-west-1 in modules/peering-accepter
- peering-accepter_ap-southeast-2_us-west-2 in modules/peering-accepter
- peering-accepter_eu-central-1_eu-north-1 in modules/peering-accepter
- peering-accepter_eu-central-1_eu-west-1 in modules/peering-accepter
- peering-accepter_eu-central-1_eu-west-2 in modules/peering-accepter
- peering-accepter_eu-central-1_eu-west-3 in modules/peering-accepter
- peering-accepter_eu-central-1_sa-east-1 in modules/peering-accepter
- peering-accepter_eu-central-1_us-east-1 in modules/peering-accepter
- peering-accepter_eu-central-1_us-east-2 in modules/peering-accepter
- peering-accepter_eu-central-1_us-west-1 in modules/peering-accepter
- peering-accepter_eu-central-1_us-west-2 in modules/peering-accepter
- peering-accepter_eu-north-1_eu-west-1 in modules/peering-accepter
- peering-accepter_eu-north-1_eu-west-2 in modules/peering-accepter
- peering-accepter_eu-north-1_eu-west-3 in modules/peering-accepter
- peering-accepter_eu-north-1_sa-east-1 in modules/peering-accepter
- peering-accepter_eu-north-1_us-east-1 in modules/peering-accepter
- peering-accepter_eu-north-1_us-east-2 in modules/peering-accepter
- peering-accepter_eu-north-1_us-west-1 in modules/peering-accepter
- peering-accepter_eu-north-1_us-west-2 in modules/peering-accepter
- peering-accepter_eu-west-1_eu-west-2 in modules/peering-accepter
- peering-accepter_eu-west-1_eu-west-3 in modules/peering-accepter
- peering-accepter_eu-west-1_sa-east-1 in modules/peering-accepter
- peering-accepter_eu-west-1_us-east-1 in modules/peering-accepter
- peering-accepter_eu-west-1_us-east-2 in modules/peering-accepter
- peering-accepter_eu-west-1_us-west-1 in modules/peering-accepter
- peering-accepter_eu-west-1_us-west-2 in modules/peering-accepter
- peering-accepter_eu-west-2_eu-west-3 in modules/peering-accepter
- peering-accepter_eu-west-2_sa-east-1 in modules/peering-accepter
- peering-accepter_eu-west-2_us-east-1 in modules/peering-accepter
- peering-accepter_eu-west-2_us-east-2 in modules/peering-accepter
- peering-accepter_eu-west-2_us-west-1 in modules/peering-accepter
- peering-accepter_eu-west-2_us-west-2 in modules/peering-accepter
- peering-accepter_eu-west-3_sa-east-1 in modules/peering-accepter
- peering-accepter_eu-west-3_us-east-1 in modules/peering-accepter
- peering-accepter_eu-west-3_us-east-2 in modules/peering-accepter
- peering-accepter_eu-west-3_us-west-1 in modules/peering-accepter
- peering-accepter_eu-west-3_us-west-2 in modules/peering-accepter
- peering-accepter_sa-east-1_us-east-1 in modules/peering-accepter
- peering-accepter_sa-east-1_us-east-2 in modules/peering-accepter
- peering-accepter_sa-east-1_us-west-1 in modules/peering-accepter
- peering-accepter_sa-east-1_us-west-2 in modules/peering-accepter
- peering-accepter_us-east-1_us-east-2 in modules/peering-accepter
- peering-accepter_us-east-1_us-west-1 in modules/peering-accepter
- peering-accepter_us-east-1_us-west-2 in modules/peering-accepter
- peering-accepter_us-east-2_us-west-1 in modules/peering-accepter
- peering-accepter_us-east-2_us-west-2 in modules/peering-accepter
- peering-accepter_us-west-1_us-west-2 in modules/peering-accepter
- peering-requester_ap-northeast-1_ap-northeast-2 in modules/peering-requester
- peering-requester_ap-northeast-1_ap-south-1 in modules/peering-requester
- peering-requester_ap-northeast-1_ap-southeast-1 in modules/peering-requester
- peering-requester_ap-northeast-1_ap-southeast-2 in modules/peering-requester
- peering-requester_ap-northeast-1_eu-central-1 in modules/peering-requester
- peering-requester_ap-northeast-1_eu-north-1 in modules/peering-requester
- peering-requester_ap-northeast-1_eu-west-1 in modules/peering-requester
- peering-requester_ap-northeast-1_eu-west-2 in modules/peering-requester
- peering-requester_ap-northeast-1_eu-west-3 in modules/peering-requester
- peering-requester_ap-northeast-1_sa-east-1 in modules/peering-requester
- peering-requester_ap-northeast-1_us-east-1 in modules/peering-requester
- peering-requester_ap-northeast-1_us-east-2 in modules/peering-requester
- peering-requester_ap-northeast-1_us-west-1 in modules/peering-requester
- peering-requester_ap-northeast-1_us-west-2 in modules/peering-requester
- peering-requester_ap-northeast-2_ap-south-1 in modules/peering-requester
- peering-requester_ap-northeast-2_ap-southeast-1 in modules/peering-requester
- peering-requester_ap-northeast-2_ap-southeast-2 in modules/peering-requester
- peering-requester_ap-northeast-2_eu-central-1 in modules/peering-requester
- peering-requester_ap-northeast-2_eu-north-1 in modules/peering-requester
- peering-requester_ap-northeast-2_eu-west-1 in modules/peering-requester
- peering-requester_ap-northeast-2_eu-west-2 in modules/peering-requester
- peering-requester_ap-northeast-2_eu-west-3 in modules/peering-requester
- peering-requester_ap-northeast-2_sa-east-1 in modules/peering-requester
- peering-requester_ap-northeast-2_us-east-1 in modules/peering-requester
- peering-requester_ap-northeast-2_us-east-2 in modules/peering-requester
- peering-requester_ap-northeast-2_us-west-1 in modules/peering-requester
- peering-requester_ap-northeast-2_us-west-2 in modules/peering-requester
- peering-requester_ap-south-1_ap-southeast-1 in modules/peering-requester
- peering-requester_ap-south-1_ap-southeast-2 in modules/peering-requester
- peering-requester_ap-south-1_eu-central-1 in modules/peering-requester
- peering-requester_ap-south-1_eu-north-1 in modules/peering-requester
- peering-requester_ap-south-1_eu-west-1 in modules/peering-requester
- peering-requester_ap-south-1_eu-west-2 in modules/peering-requester
- peering-requester_ap-south-1_eu-west-3 in modules/peering-requester
- peering-requester_ap-south-1_sa-east-1 in modules/peering-requester
- peering-requester_ap-south-1_us-east-1 in modules/peering-requester
- peering-requester_ap-south-1_us-east-2 in modules/peering-requester
- peering-requester_ap-south-1_us-west-1 in modules/peering-requester
- peering-requester_ap-south-1_us-west-2 in modules/peering-requester
- peering-requester_ap-southeast-1_ap-southeast-2 in modules/peering-requester
- peering-requester_ap-southeast-1_eu-central-1 in modules/peering-requester
- peering-requester_ap-southeast-1_eu-north-1 in modules/peering-requester
- peering-requester_ap-southeast-1_eu-west-1 in modules/peering-requester
- peering-requester_ap-southeast-1_eu-west-2 in modules/peering-requester
- peering-requester_ap-southeast-1_eu-west-3 in modules/peering-requester
- peering-requester_ap-southeast-1_sa-east-1 in modules/peering-requester
- peering-requester_ap-southeast-1_us-east-1 in modules/peering-requester
- peering-requester_ap-southeast-1_us-east-2 in modules/peering-requester
- peering-requester_ap-southeast-1_us-west-1 in modules/peering-requester
- peering-requester_ap-southeast-1_us-west-2 in modules/peering-requester
- peering-requester_ap-southeast-2_eu-central-1 in modules/peering-requester
- peering-requester_ap-southeast-2_eu-north-1 in modules/peering-requester
- peering-requester_ap-southeast-2_eu-west-1 in modules/peering-requester
- peering-requester_ap-southeast-2_eu-west-2 in modules/peering-requester
- peering-requester_ap-southeast-2_eu-west-3 in modules/peering-requester
- peering-requester_ap-southeast-2_sa-east-1 in modules/peering-requester
- peering-requester_ap-southeast-2_us-east-1 in modules/peering-requester
- peering-requester_ap-southeast-2_us-east-2 in modules/peering-requester
- peering-requester_ap-southeast-2_us-west-1 in modules/peering-requester
- peering-requester_ap-southeast-2_us-west-2 in modules/peering-requester
- peering-requester_eu-central-1_eu-north-1 in modules/peering-requester
- peering-requester_eu-central-1_eu-west-1 in modules/peering-requester
- peering-requester_eu-central-1_eu-west-2 in modules/peering-requester
- peering-requester_eu-central-1_eu-west-3 in modules/peering-requester
- peering-requester_eu-central-1_sa-east-1 in modules/peering-requester
- peering-requester_eu-central-1_us-east-1 in modules/peering-requester
- peering-requester_eu-central-1_us-east-2 in modules/peering-requester
- peering-requester_eu-central-1_us-west-1 in modules/peering-requester
- peering-requester_eu-central-1_us-west-2 in modules/peering-requester
- peering-requester_eu-north-1_eu-west-1 in modules/peering-requester
- peering-requester_eu-north-1_eu-west-2 in modules/peering-requester
- peering-requester_eu-north-1_eu-west-3 in modules/peering-requester
- peering-requester_eu-north-1_sa-east-1 in modules/peering-requester
- peering-requester_eu-north-1_us-east-1 in modules/peering-requester
- peering-requester_eu-north-1_us-east-2 in modules/peering-requester
- peering-requester_eu-north-1_us-west-1 in modules/peering-requester
- peering-requester_eu-north-1_us-west-2 in modules/peering-requester
- peering-requester_eu-west-1_eu-west-2 in modules/peering-requester
- peering-requester_eu-west-1_eu-west-3 in modules/peering-requester
- peering-requester_eu-west-1_sa-east-1 in modules/peering-requester
- peering-requester_eu-west-1_us-east-1 in modules/peering-requester
- peering-requester_eu-west-1_us-east-2 in modules/peering-requester
- peering-requester_eu-west-1_us-west-1 in modules/peering-requester
- peering-requester_eu-west-1_us-west-2 in modules/peering-requester
- peering-requester_eu-west-2_eu-west-3 in modules/peering-requester
- peering-requester_eu-west-2_sa-east-1 in modules/peering-requester
- peering-requester_eu-west-2_us-east-1 in modules/peering-requester
- peering-requester_eu-west-2_us-east-2 in modules/peering-requester
- peering-requester_eu-west-2_us-west-1 in modules/peering-requester
- peering-requester_eu-west-2_us-west-2 in modules/peering-requester
- peering-requester_eu-west-3_sa-east-1 in modules/peering-requester
- peering-requester_eu-west-3_us-east-1 in modules/peering-requester
- peering-requester_eu-west-3_us-east-2 in modules/peering-requester
- peering-requester_eu-west-3_us-west-1 in modules/peering-requester
- peering-requester_eu-west-3_us-west-2 in modules/peering-requester
- peering-requester_sa-east-1_us-east-1 in modules/peering-requester
- peering-requester_sa-east-1_us-east-2 in modules/peering-requester
- peering-requester_sa-east-1_us-west-1 in modules/peering-requester
- peering-requester_sa-east-1_us-west-2 in modules/peering-requester
- peering-requester_us-east-1_us-east-2 in modules/peering-requester
- peering-requester_us-east-1_us-west-1 in modules/peering-requester
- peering-requester_us-east-1_us-west-2 in modules/peering-requester
- peering-requester_us-east-2_us-west-1 in modules/peering-requester
- peering-requester_us-east-2_us-west-2 in modules/peering-requester
- peering-requester_us-west-1_us-west-2 in modules/peering-requester

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (hashicorp/aws) 2.59.0...
- Downloading plugin for provider "external" (hashicorp/external) 1.2.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.external: version = "~> 1.2"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
mkdir -p .stamps
touch ".stamps/init"
./scripts/softlimit distfiles/terraform-0.12.24 plan -no-color -out "tfplan.tmp"
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.aws_region_us-west-1.data.aws_availability_zones.azs: Refreshing state...
data.external.region_ids: Refreshing state...
module.aws_region_eu-central-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_eu-west-2.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_us-east-2.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_us-east-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_us-west-2.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_eu-west-3.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_eu-west-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_ap-southeast-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_ap-northeast-2.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_eu-north-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_ap-northeast-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_sa-east-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_ap-south-1.data.aws_availability_zones.azs: Refreshing state...
module.aws_region_ap-southeast-2.data.aws_availability_zones.azs: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws_region_ap-northeast-1.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.64.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-1a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-1.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.66.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-1c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-1.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.68.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-1d.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-1.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.ap-northeast-1.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-1a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-1c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-1d.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.64.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.66.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.68.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-1d.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.64.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.ap-northeast-1a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.66.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.ap-northeast-1c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.68.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.ap-northeast-1d.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = true
      + cidr_block                       = "10.60.64.0/20"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "ap-northeast-1.int.jlyo.net"
        }
    }

  # module.aws_region_ap-northeast-1.aws_vpc_dhcp_options.dhcp will be created
  + resource "aws_vpc_dhcp_options" "dhcp" {
      + domain_name         = "int.jlyo.net"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_dhcp_options_association.dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.dynamodb_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.dynamodb_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "dynamodb_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.s3_dmz will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_dmz" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.s3_lan[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.s3_lan[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-1.aws_vpc_endpoint_route_table_association.s3_lan[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "s3_lan" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_egress_only_internet_gateway.eigw will be created
  + resource "aws_egress_only_internet_gateway" "eigw" {
      + id     = (known after apply)
      + vpc_id = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + vpc_id   = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_network_interface.nat[0] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.80.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-2a.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-2.aws_network_interface.nat[1] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.82.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-2b.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-2.aws_network_interface.nat[2] will be created
  + resource "aws_network_interface" "nat" {
      + id                = (known after apply)
      + mac_address       = (known after apply)
      + private_dns_name  = (known after apply)
      + private_ip        = (known after apply)
      + private_ips       = [
          + "10.60.84.4",
        ]
      + private_ips_count = (known after apply)
      + security_groups   = (known after apply)
      + source_dest_check = true
      + subnet_id         = (known after apply)
      + tags              = {
          + "Name" = "natgw.ap-northeast-2c.int.jlyo.net"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.aws_region_ap-northeast-2.aws_route.eigw[0] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.eigw[1] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.eigw[2] will be created
  + resource "aws_route" "eigw" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.igw6 will be created
  + resource "aws_route" "igw6" {
      + destination_ipv6_cidr_block = "::/0"
      + destination_prefix_list_id  = (known after apply)
      + egress_only_gateway_id      = (known after apply)
      + gateway_id                  = (known after apply)
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + nat_gateway_id              = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = (known after apply)
      + state                       = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route.nat[2] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table.dmz will be created
  + resource "aws_route_table" "dmz" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "dmz.ap-northeast-2.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table.lan[0] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-2a.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table.lan[1] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-2b.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table.lan[2] will be created
  + resource "aws_route_table" "lan" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "lan.ap-northeast-2c.int.jlyo.net"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.dmz[0] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.dmz[1] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.dmz[2] will be created
  + resource "aws_route_table_association" "dmz" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.lan[0] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.lan[1] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_route_table_association.lan[2] will be created
  + resource "aws_route_table_association" "lan" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.dmz[0] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.80.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-2a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.dmz[1] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.82.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-2b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.dmz[2] will be created
  + resource "aws_subnet" "dmz" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.84.0/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "dmz.ap-northeast-2c.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.lan[0] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.80.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.ap-northeast-2a.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.lan[1] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.82.128/25"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "lan.ap-northeast-2b.int.jlyo.net"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_region_ap-northeast-2.aws_subnet.lan[2] will be created
  + resource "aws_subnet" "lan" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = true
      + availability_zone               = "ap-northeast-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.60.84.128/25"
      + id                              = (known after a
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.